Repository: ysq1051838264/MlcForExcel
Catalog: lib/src/main/java/com/hdr/mlcforexcel/forexample/mlc/TT healthier/ios/*.strings
Languages: french, russian

source: Password Format Error
french: Erreur de format du mot de passe
russian: Неправильный формат пароля

# LoginAndRegister_jionYolanda
source: JOIN TT HEALTHIER
french: JOINDRE TT HEALTHIER
russian: Присоединяйтесь к TT healthier

# TabBar_measuring
source: Measuring
french: Examiner
russian: Измерение

# TabBar_charts
source: Trend
french: Chronologie
russian: Диаграмма

# TabBar_profile
source: My Account
french: Compte
russian: Мой аккаунт

# BLEAPI_lowEnergy
source: Low battery
french: Batterie faible
russian: Низкий уровень заряда батареи

# LoginAndRegister_login
source: LOG IN
french: S'IDENTIFIER
russian: Вход

# LoginAndRegister_register
source: Register
french: Enregistre
russian: Создать аккаунт

# LoginAndRegister_welcomeBack
source: Welcome Back
french: Bienvenue votre retour
russian: Добро пожаловать

# LoginAndRegister_email
source: Email
russian: Электронная почта

# LoginAndRegister_password
source: Password
french: Mot de passe
russian: Пароль

# LoginAndRegister_confimPassword
source: Confirm Password
french: Confirmez le mot de passe
russian: Подтвердить пароль

# LoginAndRegister_noAccount
source: Have no account
french: Pas de compte
russian: У меня нет аккаунта

# LoginAndRegister_creatAccount
source: Create my account
french: Creer un compte
russian: Создать аккаунт

# LoginAndRegister_haveAccount
source: I already have an account
french: J'ai déjà un compte
russian: У меня уже есть аккаунт

# LoginAndRegister_next
source: NEXT
french: Suivant
russian: Далее

# IOS_CameraAuthorization_tip
source: You have not authorized TT healthier, please authorize the camera function in Setting-Privacy-Camera.
french: Veuillez autoriser TT healthier à prendre des photos ou des vidéos
russian: Разрешить TT healthier использование камеры?

# IOS_ImageLibraryAuthorization_tip
source: You have not authorized TT healthier, please authorize the album function in Setting-Privacy-Album.
french: Veuillez autoriser TT healthier à prendre des photos ou des vidéos
russian: Разрешить TT healthier доступ к фотоальбомам?

# BLEPoweredOff
source: Please turn on bluetooth.
french: Allumez Bluetooth
russian: Включить Bluetooth (в настройках телефона)

# LoginNextClick
source: Click next to agree
french: En cliquant sur Suivant, vous acceptez nos conditions
russian: Нажимая "Далее", Вы подтвержаете, что Вы прочитали и согласны

# AboutSoftwareDevelopers
source: Software Developer
french: Apps fournisseur
russian: Разработчик

# AboutEquipmentManufacturer
source: Equipment Manufacturer
french: Fournisseur de matériel
russian: Производитель аппаратного обеспечения

# MyDeviceViewController_compare
source: Comparing
french: Comparer
russian: Сравнение

# measurefragment_connecting
source: Connecting
french: Connexion au téléphone / pad
russian: Соединение с моим смартфоном / планшетом

# measurefragment_measureing
source: Measuring
french: En mesurant
russian: Измерение

# measurefragment_last_time
source: Last Time
french: Dernière fois
russian: Последний раз

# DevicePassword_turnOn
source: Turn on App Lock
french: Activer / désactiver le verrouillage de l'App
russian: Включить/выключить блокировку приложения

# DevicePassword_description
source: You can creat your enter passcode to lock this APP
french: Vous pouvez verrouiller cette application mobile pour protéger votre vie privée
russian: Вы можете заблокировать данное приложение, чтобы защитить Ваши данные

# DevicePassword_inputPassword
source: Passcode
french: Code d'accès
russian: Пароль

# DevicePassword_inputPasswordAgain
source: Passcode Again
french: comfirmez Code d'accès
russian: Введите пароль снова

# DevicePassword_passwordNotMatch
source: Inconsistent passcode, please try again
french: Code d'accès différent et réessayez
russian: Другой пароль и попробуйте снова

# DevicePassword_passwordWrong
source: Wrong passcode
french: Mot de passe incorrect
russian: Неправильный пароль

# EditRemindViewController_title
source: Edit Alarm
french: Rappel de pesage
russian: Напоминание о взвешивании

# SetupDevice_selectedUnit
source: Choose the weight unit
french: Choisir unité de poids
russian: Выберите единицы массы

# sure
source: Confirm
french: Confirmer
russian: Подтвердить

source: Cancel
french: Annuler
russian: Отмена

# bad_network
source: Network Unavailable
french: Réseau indisponible
russian: Сеть недоступна

# bodyShape
source: Body type
french: Évaluation physique
russian: Физические данные

source: Weight
french: Poids
russian: Масса тела (кг)

# fatFreeWeight
source: Fat-free Body Weight
french: Poids de matières non grasses
russian: Масса тела без учёта жира

source: BMI
russian: Индекс массы тела

source: Body Fat
french: Graisse corporelle
russian: Жир в теле (%)

source: Protein
french: Protéine
russian: Протеин

source: BMR
french: Taux Métabolique de Base
russian: Основной обмен

# subfat
source: Subcutaneous Fat
french: De la graisse sous - cutanée
russian: Подкожный жир

# visfat
source: Visceral Fat
french: Graisse viscérale
russian: Жир живота

# water
source: Body Water
french: Eau Corporelle Totale
russian: Вода в теле (%)

# bone
source: Bone Mass
french: Masse osseuse
russian: Масса костей

# muscle
source: Skeletal Muscle
french: Taux de muscle squelettique
russian: Скелетная мышечная ткань (%)

# sinew
source: Muscle Mass
french: Masse musculaire
russian: Мышечная масса

# bodyage
source: Metabolic Age
french: Âge métabolique
russian: Метаболический возраст

# userFigure_InvisibleObese
source: Covertly fat
french: Caché obèses
russian: Скрытый жир

# userFigure_Overweight
source: Heavy
french: Obèses
russian: Жир

# userFigure_Obese
source: Heavy-set
french: Obésité
russian: тучность

# userFigure_SlimMuscle
source: Thin & Muscular
french: Mince & musculaire
russian: Тощ. и мускул.

# userFigure_Normal
source: Standard
french: Norme
russian: Норма.

# userFigure_VeryMuscular
source: Strong Muscular
french: Très musclé
russian: Очень мускулист.

# userFigure_Slim
source: Thin
french: Mince
russian: Тощ.

# userFigure_NormalMuscle
source: Standard Muscular
french: Niveau musculaire
russian: Норм. мускулист.

# userFigure_LackEexercise
source: Under Exercised
french: Moins exercé
russian: Нетрениров.

# register_password
source: Password(6~16 digital numbers or letters)
french: Mot de passe (6 ~ 16 numéros ou Lettres)
russian: Пароль (от 6 до 16 знаков, допускаются цифры и буквы)

# ChoiceViewController_forgetPassword
source: Forget Password
french: Mot de passe oublié
russian: Забыли пароль?

# AddNewUserViewController_failToSend
source: Request Failed
french: Échoué
russian: Не удалось выполнить запрос

# RegisterViewController_inputCode
source: Verification Code
french: Le code de vérification
russian: Код подтверждения

# RegisterViewController_getCode
source: Send
french: Obtenir
russian: Отправить

# RegisterViewController_sending
source: Sending
french: Envoi
russian: Отправка

# UserInfoViewController_nikeName
source: Name
french: Surnom
russian: Имя

# RegisterViewController_birthday
source: Birthday
french: Anniversaire
russian: День рождения

# RegisterViewController_height
source: Height
french: La taille
russian: Рост

# RegisterViewController_man
source: Male
french: Homme
russian: Муж.

# RegisterViewController_women
source: Female
french: Femme
russian: Жен.

# agreement
source: Agree
french: Accepter
russian: Согласен

# refuse
source: Don't Agree
french: Ne pas accepter
russian: Не согласен

# RegisterViewController_emailIsEmpty
source: Email Address Needed
french: Email Adresse requise!
russian: Нужен адрес электронной почты

# RegisterViewController_codeIsEmpty
source: Verification Code needed!
french: Code de vérification nécessaire!
russian: Нужен код подтверждения

# RegisterViewController_passwordIsEmpty
source: Password needed!
french: Mot de passe requis!
russian: Введите пароль

# RegisterViewController_confirmPasswordIsEmpty
source: Password needed again!
french: Mot de passe requis!
russian: Ввведите пароль снова

# RegisterViewController_usernameIsEmpty
source: Name needed!
french: Surnom requis!
russian: Введите имя

# register_email_error
source: Invalid Email Address
french: L'adresse Email n'est pas correcte!
russian: Недействительный адрес электронной почты

# auth_code_send_success
source: Please check the Verification Code in your email box
french: Veuillez saisir le code de vérification dans votre boîte d'Email
russian: На указанный Вами электронный адрес выслан код подтверждения

# auth_code_send_failure
source: Verification Code sent failed
french: Le code de vérification envoyé a échoué
russian: Не удалось отправить код подтверждения

# RegisterViewController_codeIsError
source: Wrong verification Code
french: Le code de vérification n'est pas correct
russian: Неправильный код подтверждения

# RegisterViewController_passwordIsSame
source: Inconsistent passcode
french: Code différent et réessayez
russian: Попробуйте ещё раз

# RegisterViewController_approval
source: Privacy Rules
french: Règles de confidentialité
russian: Правила конфиденциальности

# UserInfoViewController_headPortrait
source: Avatar
french: photo de profil
russian: Фото профиля

# UserInfoViewController_sex
source: Gender
french: sexe
russian: Пол

# ModifyPassWordViewController_oldPassword
source: Old password
french: Ancien mot de passe
russian: Старый пароль

# user_modify_user_info
source: Profile
french: Profil
russian: Профиль

# MyViewController_newUser
source: New Member
french: Nouvel utilisateur
russian: Новый пользователь

# MyViewController_addLocalFamily
source: Add Measuring User
french: Ajouter l'utilisateur de mesure
russian: Добавить пользователя

# MyViewController_addRemoteFamily
source: Add TT healthier Friends
french: Ajouter les utilisateurs TT healthier
russian: Добавить друзей в TT healthier

# AddNewUserViewController_text1
source: Connect to your friend's TT healthier account
french: Connectez-vous au compte TT healthier de votre ami
russian: Свяжитесь в TT healthier со своими друзьями

# AddNewUserViewController_text3
source: Once your friends being in TT healthier APP, you will be able to access friend’s body composition measurements, and aslo view their historical data.
french: Une fois Etre amis dans TT healthier APP, vous serez capable de: n accéder aux mesures de la composition corporelle de vos amis, ainsi que de visualiser leurs données historiques.
russian: Если Вы в TT healthier добавили человека в друзья, Вы сможете смотреть его измерения

# UserInfoViewController_accountRegistration
source: Creat TT healthier Account(Optional)
french: Créer un compte TT healthier (facultatif)
russian: Создать аккаунт в TT healthier

# RegisterViewController_birthdayIsEmpty
source: Invalid Birthday
french: Anniversaire non valide
russian: Недействительная дата рождения

# RegisterViewController_heightIsEmpty
source: Invalid Height
french: La taille non valide
russian: Недействительный рост

# bind_device
source: Pairing Your Accessory
french: Accouplement de votre accessoire
russian: переплетного оборудования

# ModifyPassWordViewController_newPassword1
source: Confirm New password
french: Confirmer le nouveau code d'accès
russian: Подтвердить пароль

# AnalysisReportViewController_standand_bodyShape
source: General description and evaluation to body's shape
french: Description générale et évaluation de la forme du corps
russian: Общее описание и оценка формы тела

# AnalysisReportViewController_standand_weight
source: One of the important signs of a person's health status
french: Un des signes importants de l'état de santé d'une personne
russian: Один из важных показателей состояния здоровья человека

# AnalysisReportViewController_standand_fatFreeWeight
source: Muscle is one of the main part to weight of other body components except fat.
french: Poids des autres composants du corps, sauf la graisse
russian: Масса тела без учёта жира

# AnalysisReportViewController_standand_bmi
source: Body mass index
french: Indice de masse corporelle
russian: Индекс массы тела

# AnalysisReportViewController_standand_bodyfat
source: The proportion of adipose tissue to body composition
french: La proportion de tissu adipeux dans le poids corporel
russian: Доля жировой ткани в массе тела

# AnalysisReportViewController_standand_protein
source: Protein plays a vital role in the body, building and maintaining muscles, organs and other tissue
french: La protéine joue un rôle vital dans le corps, la construction et l'entretien des muscles, des organes et d'autres tissus
russian: Протеин играет жизненно важную роль в теле человека, в создании и поддержке мышц, органов и других тканей

# AnalysisReportViewController_standand_bmr
source: Basal Metabolic Rate.In an inactive state, the minimum necessary energy to sustain life
french: Basal Metabolic Rate.In un état inactif, l'énergie minimale nécessaire pour soutenir la vie
russian: Основной обмен - это минимальное количество энергии, необходимое для обеспечения нормальной жизнедеятельности организма в стандартных условиях

# AnalysisReportViewController_standand_subfat
source: The proportion of adipose tissue stored in the skin to body weight
french: La proportion de tissu adipeux stockée dans la peau en poids corporel
russian: Доля в массе тела жировой ткани, находящейся в коже

# AnalysisReportViewController_standand_visfat
source: A kind of body fat but different to subcutaneous fat, it revolves around the human organs, mainly in the abdominal cavity
french: Une sorte de graisse corporelle mais différente de la graisse sous-cutanée, elle tourne autour des organes humains, principalement dans la cavité abdominale
russian: Жир в теле, отличный от подкожного жира. Он расположен вокруг органов человека, в основном в брюшной полости.

# AnalysisReportViewController_standand_water
source: The proportion of human body water in weight, the human body water including blood, lymph, extracellular fluid, etc..
french: La proportion de l'eau du corps humain dans le poids, l'eau du corps humain, y compris le sang, la lymphe, le liquide extracellulaire, etc.
russian: Доля жидкости в массе тела человека, включая кровь, лимфу, внеклеточную жидкость и т.д.

# AnalysisReportViewController_standand_bone
source: It is bone tissue (Bone mineral (Ca, P and so on)) and bone matrix (ossein, Protein, inorganic salt and so on) per unit volume.
french: C'est le tissu osseux (minéral osseux (Ca, P etc )) et la matrice osseuse (osséine, protéine, sel inorganique etc) par unité de volume.
russian: Это костная ткань и оссеин с протеином и неорганической солью, приходящиеся на единицу объёма

# AnalysisReportViewController_standand_muscle
source: The proportion of skeletal muscle to weight, the skeletal muscle is related to the body motion system and attached on bone
french: La proportion de muscle squelettique en poids, le muscle squelettique est liée au système de mouvement du corps et attaché sur l'os
russian: Доля скелетной мышечной ткани в массе тела человека

# AnalysisReportViewController_standand_sinew
source: The total muscle weight, including skeletal muscle, cardiac and smooth muscle.
french: Le poids total du muscle, y compris le muscle squelettique, le muscle cardiaque et le muscle lisse.
russian: Общая масса мышц, включая скелетную мышечную ткань, гладкие мышцы и миокард

# AnalysisReportViewController_standand_bodyage
source: Ideal physical body age is 2/3 of the actual age.
french: Âge idéal du corps physique = age reel * ２ / ３
russian: Идеальный биологический возраст составляет 2/3 от реального возраста

# no_data_for_now
source: Empty Data
french: Données vides
russian: Нет данных

# HistoryViewController_doDelete
source: Are you sure to delete it?
french: Voulez-vous la supprimer?
russian: Вы уверены, что хотите удалить?

# delete_success
source: Deleted
french: Supprimé
russian: Удалено

# SystemViewController_mydevice
source: My Connected Accessory
french: Mes appareils
russian: Мои устройства

# SystemViewController_feedback
source: Feedback
french: Commentaires
russian: Обратная связь

# SystemViewController_about
source: About
french: Sur
russian: Информация

# SystemViewController_remind
source: Measurement Alarms
french: Mess-Alarme
russian: Напом. о взвешивании

# SystemViewController_password
source: Lock Password
french: Mot de passe
russian: Пароль

# personalize_unit_switch
source: Weight Unit
french: Unité de poids
russian: Единицы массы

# ThemeColorViewController_title
source: Themes
french: Thèmes
russian: Темы

# FeedBackViewController_Placeholder
source: Feedback your opinion, and we will send answers to your Account Email and Message Hub
french: Donnez votre opinion et nous vous enverrons des réponses à votre compte Email et centre de messagerie
russian: Оставьте своё мнение, и мы ответим на Вашу электронную почту

# ThemeColorViewController_blue_sky
source: Sky Blue
french: Bleu ciel
russian: Голубой

# ThemeColorViewController_blue_sea
source: Ocean Blue
french: Océan bleu
russian: Циановый

# ThemeColorViewController_red
source: Charming Magenta
french: Rouge
russian: Маджента

# ThemeColorViewController_orange
source: Sweet Orange
french: Orange
russian: Оранжевый

# ThemeColorViewController_green
source: Emerald Green
french: Vert
russian: Зелёный

# ThemeColorViewController_purple
source: Royal Violet
french: Violet
russian: Фиолетовый

# MyViewController_logout
source: Log Out
french: Se déconnecter
russian: Выход

# system_language_choose
source: Languages
french: Langues
russian: Языки

# MyViewController_doLogOut
source: Are you sure to log off?
french: Etes-vous sûr de vous déconnecter?
russian: Вы уверены, что хотите выйти?

# current_device_not_support_bluetooth
source: Your Smart Phone can not support Bluetooth 4.0
french: Votre Smart Phone ne prend pas en charge Bluetooth 4.0
russian: Вам смартфон не поддерживает Bluetooth 4.0

# MyDeviceViewController_noDevices
source: No scale paired
french: Aucun périphérique apparié
russian: Весы не подключены

# MyDeviceViewController_delete
source: Delete
french: Effacer
russian: Удалить

# FeedBackViewController_sendSuccess
source: Send Successfully
french: Envoyer avec succès
russian: Успешно отправлено

# ChartViewController_week
source: Week
french: semaine
russian: Неделя

# ChartViewController_month
source: Month
french: Mensuel
russian: Месяц

# ChartViewController_year
source: Year
french: Annuel
russian: Год

# AboutViewController_version
source: Version
french: Versions
russian: Версия

# please_select_measure_user
source: Which member's result?
french: choisir resultat de membre.
russian: Чей результат?

# already_is_latest
source: No New Updates
french: Aucune nouvelle mise à jour
russian: Нет новых обновлений

# version_update_fault
source: Update failed, and please confirm network works well.
french: La mise à jour a échoué et confirmez que le réseau fonctionne bien.
russian: Не удалось выполнить обновление. Проверьте, что подключение к сети исправно.

source: Updating
french: Mise à jour
russian: Обновление…

# new_version_msg
source: Latest Version Coming
french: Nouveau mis à jour est pret
russian: Доступна последняя версия

# version_exit
source: Exit
french: Sortie
russian: Выход

# version_not_update
source: Ignore
french: Ignorer
russian: Пропустить

# version_upgrade_immediately
source: Update
french: Mise à jour
russian: Обновить

# version_is_latest
source: No New Updates
french: Aucune nouvelle mise à jour
russian: Нет новых обновлений

# change_data
source: Changed and Stored Well
french: Modification réussite
russian: Изменения внесены

# open_camera_fail
source: Failed to Access Camera
french: Échec de l'accès à la caméra
russian: Нет доступа к камере

# MyDeviceViewController_chooseDevice
source: Choose Accessory
french: Choisir un périphérique
russian: Выберите устройство

# RegisterViewController_fromPhoto
source: Choose Photos
french: Choisissez des photos
russian: Выберите фото

# RegisterViewController_camera
source: Take Photos
french: Prendre des photos
russian: Снять фото

# feedback_content_should_not_empty
source: No Comments
french: Sans commentaires
russian: Нет комментариев

# weight_too_much
source: Totally different weight than before
french: Poids trop différent qu'avant
russian: Другая масса

# is_not_you
source: IS that yours?
french: Est-ce à Vous?
russian: Это Ваше?

# is_not_me
source: Not mine
french: Non
russian: Нет

# is_me
source: It’s mine
french: C'est à moi
russian: Да

# DetectionViewController_OnlyWeight
source: No Fat and Bio impedance detected. Try again and following:
french: Aucune impédance de gras et de bio détectée. Réessayez et suivez les instructions suivantes:
russian: Биоимпедансометрия не выполнена. Попробуйте ещё раз и выполните следующее:

# DetectionViewController_measurementWay
source: 1, bare feet, 2, stand straight on Scale with Legs naturally separated, face to LED digital numbers, 3, wait to LED be stable
french: 1, les pieds nus, 2, se tenir droit sur l'échelle avec les jambes naturellement séparés, face à des numéros numériques LED, 3, attendre à LED être stable
russian: 1. Снимите обувь и носки. 2. Встаньте на весы лицом к их дисплею, при этом ступни не должны касаться друг друга. 3. Дождитесь показаний весов на экране.

# DetectionViewController_reMeasurement
source: Measure Again
french: Re-Test
russian: Мера Снова

# DetectionViewController_saveMessage
source: Save Data
french: Enregistrer
russian: Сохранить

# DetectionViewController_noTip
source: Ignore
french: Ignorer
russian: Пропустить

# HealthKitExplainViewController_title
source: Apple Health Kit Setting
french: Réglage du kit de santé Apple
russian: Настройка Apple Здоровье

# MyDeviceViewController_ModifyDevicenName
source: Change accessory's name
french: Modifier le nom de l'appareil
russian: Поменяйте имя оборудования

# FeedBackViewController_invisableInfo
source: What can we do for you? write here and we will feedback to you by email within 2 working days
french: Que pouvons-nous faire pour vous? Écrivez ici et nous vous ferons des commentaires par courriel dans les 2 jours ouvrables
russian: Что мы можем сделать для Вас? Напишите и мы ответим Вам по e-mail в течение двух рабочих дней.

# FeedBackViewController_infoMust20Plus
source: Need more than 20 characters
french: Besoin de plus de 20 caractères
russian: Требуется больше 20 знаков

# AddNewUserViewController_confirm
source: Sending
french: Envoi
russian: Отправка

# HistoryViewController_loading
source: Preparing
french: En train de préparer
russian: Подготовка

# error_logged_on_the_other
source: Your account is Logging in another Phone/Tablet, Permit?
french: Votre compte est Connexion à un autre Smart Phone, Permit?
russian: В Ваш аккаунт уже выполнен вход на другом смартфоне/планшете

# choose_storage_data
source: Choose Measured Data
french: Choisir les données Examinées
russian: Выберите данные и передайте их нужному пользователю

# delete_data_and_exit
source: Exit and Delete All
french: Quitter et supprimer tout
russian: Выйти и удалить всё

# do_not_dispatch_users
source: No member matched with last weighting data
french: Aucun membre ne correspond aux dernières données de poids
russian: Этот вес не соответствует прошлому пользователю

# some_dispatch_data_dispatched
source: Weighting Data matched to following Members:
french: Pondération Données correspondant aux membres suivants:
russian: Данные взвешивания будут переданы на следующим пользователям данного устройства:

# chooseDatedistribution_saveDistribution
source: Matching Weights
french: Poids correspondants
russian: Передача данных взвешивания

# chooseDatedistribution_tip
source: Matching the weights to members
french: Associer les poids aux membres
russian: Выберите данные и передайте их нужному пользователю
