Repository: ysq1051838264/MlcForExcel
Catalog: lib/src/main/java/com/hdr/mlcforexcel/forexample/mlc/TT healthier/ios/*.strings
Languages: french, russian

# share_generate_file
source: Generating CSV data...
french: Génération de données CSV ...
russian: Создание CSV-данных ...
