Repository: ysq1051838264/MlcForExcel
Catalog: lib/src/main/java/com/hdr/mlcforexcel/forexample/mlc/TT healthier/ios/*.strings
Languages: french, russian

# chooseDatedistribution_selectData
source: Choose weight number first
french: Choisir numéro de poids d'abord
russian: Вы не выбрали данные

# chooseDatedistribution_selectedAll
source: Choose All
french: Choisir tous
russian: Выбрать всё

# messageCenter_title
source: Message Hub
french: Centre message
russian: Сообщения

# messageCenter_allReal
source: Mark all messages as Read
french: Tout lu
russian: Отметить все сообщения как прочитанные

# messageCenter_deletedAllMessage
source: Delete All message
french: Tout effacer
russian: Удалить все сообщения

# messageCenter_messageDetail
source: Details
french: Détails
russian: Подробности

# messageCenter_look
source: Read
french: Consulter
russian: Прочитать

# messageCenter_no_hand
source: can not process the message
french: Ne peut pas traiter le message
russian: Не удаётся обработать сообщение

# put_in_batteries_and_step_up
source: Install battery, and stand on the Scale
french: Installer la batterie, et se peser
russian: Вставьте батарею и встаньте на весы

# led_light_on
source: Digital LED will be lighting
french: LED numérique sera l'éclairage
russian: Включится цифровой дисплей

# add_local_or_remote_family
source: Click right here to add measuring user and tt healthier friend
french: Cliquez ici pour ajouter des familles et des amis
russian: Нажмите здесь, чтобы добавить данные пользователя

# ChartViewController_dataSourch
source: Prefer Time
french: Période de temps
russian: Источники данных

# ChartViewController_am
source: AM
french: Matin
russian: утро

# ChartViewController_pm
source: PM
french: Après midi
russian: после полудня

# ChartViewController_day
source: All Day
french: Toute la journée
russian: весь день

# HistoryViewController_history_title
source: History
french: Données historiques
russian: История

# HistoryViewController_calendar_Sun
source: SUN
french: DIM
russian: Вс

# HistoryViewController_calendar_Mon
source: MON
french: LUN
russian: Пн

# HistoryViewController_calendar_Tues
source: TUE
french: MAR
russian: Вт

# HistoryViewController_calendar_Wed
source: WED
french: MER
russian: Ср

# HistoryViewController_calendar_Thur
source: THU
french: JEU
russian: Чт

# HistoryViewController_calendar_Fri
source: FRI
french: VEN
russian: Пт

# HistoryViewController_calendar_Sat
source: SAT
french: SAM
russian: Сб

# system_setting
source: Setting
french: Réglage
russian: Настройки

# PAPasscodeViewController_modifyPasscode
source: Change password
french: Changer le mot de passe
russian: Сменить пароль

source: Send Again
french: Envoyer à nouveau
russian: Отправить снова

# set_pwd_success
source: App lock Enabled
french: Mot de passe activé
russian: Приложение заблокировано

# system_forget_device_pwd
source: Passcode Forgot
french: Mot de passe oublié
russian: Забыли пароль?

# IOS_appVersionTip
source: New Version
french: Nouvelle version
russian: Новая версия

# RegisterViewController_lowAge10
source: Children younger than 10 years old cannot measure body fat percentage and other indicators
french: Les enfants de moins de 10 ans ne peuvent mesurer le pourcentage de graisse corporelle et d'autres indicateurs
russian: Дети, которым меньше 10 лет, не могут измерять долю жира и другие показатели

# RegisterViewController_lowAge18
source: Users younger than 18 years old cannot be measured in muscle mass,bone mass, body age, visceral fat ,Skeletal Muscle ,Pretein!
french: Les utilisateurs âgés de moins de 18 ans ne peuvent pas être mesurés en masse musculaire, masse osseuse, âge du corps, graisse viscérale, muscle squelettique, prétein!
russian: Пользователи, которым меньше 18 лет, не могут измерять мышечную массу, костную массу, биологический возраст, висцеральный (внутренний) жир, скелетную мышечную массу, протеин

# date_format_measure
source: MMM d hh:mm a
french: dd MM hh:mm a
russian: MM dd hh:mm a

# date_format_calendar_year_month
source: MMM yyyy
french: MM.yyyy
russian: MM.yyyy

# IOS_date_format_calendar_year_month
source: MMM yyyy
french: MM yyyy
russian: MM yyyy

# date_format_chart_month_day
source: M/d
french: d/M
russian: d/M

# date_format_chart_year_month_day
source: M/d/yy
french: d/M/yy
russian: d/M/yy

# date_format_calandar_full
source: M/d.yy a hh:mm
french: d/M/yy a hh:mm
russian: d/M/yy a hh:mm

# date_format_second
source: MM/dd/yyyy HH:mm:ss
french: dd/MM/yyyy HH:mm:ss
russian: dd/MM/yyyy HH:mm:ss

# date_format_minite
source: MM/dd/yyyy HH:mm
french: dd/MM/yyyy HH:mm
russian: dd/MM/yyyy HH:mm

# date_format_day
source: MM/dd/yyyy
french: dd/MM/yyyy
russian: dd/MM/yyyy

# AnalysisReportViewController_seriousShortage
source: inadequate
french: Inadéquat
russian: серьезный

# scale_target_low
source: Low
french: Faible
russian: низкий

# scale_target_standard
source: Meet standard
french: Satisfaire à la norme
russian: Норма

# scale_target_noStandard
source: Do not meet standard
french: Ne répond pas aux normes
russian: Не соответствует стандарту

# scale_target_enough
source: Enough
french: Assez
russian: Достаточно

# scale_target_qualified
source: Standard
french: Norme
russian: Норма

# scale_target_hight
source: High
french: Haute
russian: Высокая

# AnalysisReportViewController_seriousExceedStandard
source: Exceeded
french: Dépassé
russian: Превышен

# report_skeleta_muscle_inadequate
source: Inadequate
french: Inadéquat
russian: неадекватный

# goal_set
source: Set goal
french: objectif fixé
russian: Установить цель

source: Goal
french: objectif
russian: цель

# goal_complete
source: Congratulations, have achieved your goal
french: Félicitations, a terminé l'objectif
russian: Поздравляем, завершил цель

source: Current weight
french: Poids actuel
russian: Нынешний вес

# come_from
source: SINCE
french: venir de
russian: Родом из

source: Connect
french: raccordement
russian: подключение

# not_find_scale
source: Can't pair your scale
french: Impossible d'associer votre échelle
russian: подключение

# reboot_bluetooth
source: Reboot the Bluetooth
french: Redémarrez le Bluetooth
russian: Перезагрузите Bluetooth

# reload_battery
source: Reload the battery
french: Rechargez la batterie
russian: Перезагрузите аккумулятор.

# measure_voice
source: Measuring sound
french: Warnsignale
russian: Звуковые оповещения

# SetupDevice_selectedHeightUnit
source: Choose the height unit
french: Choisissez l'unité de hauteur
russian: Выберите единицу измерения высоты

# feedback_image_upload_failure
source: Image upload failed, please try again!
french: Le téléchargement de l'image a échoué, réessayez!
russian: Не удалось загрузить изображение. Повторите попытку.

# feedback_record
source: Recording
french: Enregistrement
russian: Запись

# feedback_message_detail
source: Details
french: Détails
russian: Детали

# pictures_are_not_upload_success
source: Please wait, the picture is being uploaded
french: Veuillez patienter, la photo est téléchargée
russian: Пожалуйста, подождите, изображение загружается

# system_weight_kg
source: kg
russian: Кг

# system_weight_lb
source: lb
russian: Фунты

# BLEError
source: A Bluetooth error occurred. Please try restarting Bluetooth
french: Une erreur Bluetooth s'est produite. Essayez de redémarrer Bluetooth
russian: Произошла ошибка Bluetooth. Попробуйте перезапустить Bluetooth

# TabBar_wristband
source: Wristband
french: bracelet
russian: Браслет

# NavigationOption_scale
source: Smart scale
french: Échelles intelligentes
russian: Смарт-весы

# wristbandSetSuccess
source: Setting Success
french: Configurer avec succès
russian: Настройка прошла успешно

# wristbandSetFail
source: Setting Failed
french: L’installation a échoué
russian: Не удалось настроить

# unconnectedDevice
source: Device not Connected
french: Dispositif non connecté
russian: Оборудование не подключено

# notSynchronizedData
source: Unsynced
french: Données non synchronisées
russian: Несинхронизированные данные

# synchronizedData
source: Data synced at %@
french: Synchronisé en %@
russian: Синхронизация с хх

# firmwareVersion
source: Version
french: Version du firmware
russian: Версия прошивки

# batteryRemaining
source: Battery capacity
french: Marge de la batterie
russian: Остаток заряда аккумулятора

# open
source: ON
french: Allumé
russian: Включено

# unopened
source: OFF
french: non ouvert
russian: Не включено

# multiple
source: MultiLists
french: Plusieurs
russian: Несколько

source: Repeat
french: répéter
russian: Повторить

# wristbandSetIncomingCall
source: Call Alert
french: appel entrant
russian: Уведомление о входящем звонке

# incomingCallDescription
source: When enabled,an incoming call alert will be allowed via the device
french: Lorsqu’il est activé, une alerte d’appel entrante sera autorisée via l’appareil
russian: Разрешить присылать уведомления о входящем звонке после включения оборудования

# incomingCallTimeDescription
source: The bracetet began to remind after call %@ seconds
french: Appelez %@ secondes après que le bracelet a commencé à rappeler
russian: Уведомление на браслете после хх секунд входящего звонка

# wristbandSetSedentaryReminder
source: Sedentary Alert
french: Rappel sédentaire
russian: Уведомление о сидении на протяжении длительного времени

# sedentaryReminderDescription
source: When turned on,it will allow a sedentary reminder through the device
french: Lorsqu’elle est allumée, elle permettra le rappel sédentaire à travers l’appareil
russian: Разрешить присылать уведомления о сидении на протяжении длительного времени после включения оборудования

# sedentaryReminderTimeDescription
source: Inactivity time up to %@ minutes to start a reminder
french: Ne pas activer jusqu’à %@ minutes pour commencer à rappeler
russian: Начать присылать уведомления, если время без движения достигает хх минут

# startingTime
source: Start time
french: Heure de départ
russian: Время начала

source: End time
french: Heure de fin
russian: Время окончания

# wristbandSetSmartAlarmReminders
source: Alarm Alert
french: Rappels d’alarme intelligents
russian: Уведомления смарт-будильника

# wristbandMaxAlarmNumTip
source: Reach the max setting alarm
french: Le nombre actuel d’alarmes atteint la limite supérieure
russian: Количество будильников достигло максимума

# smartAlarmRemindersDescription
source: When you add an alarm,it will allow alarm alerts to be made through the device
french: Lorsque vous ajoutez une alarme, l’alarme sera autorisée via l’appareil
russian: Разрешить присылать уведомления будильника через оборудование после добавления будильника и включения

# addAnAlarmClock
source: Add Alarm List
french: Ajouter une alerte d’alarme
russian: Добавить уведомление будильника

# alarmSetTheTime
source: Setting Time
french: Régler l’heure
russian: Установленное время

# alarmSetName
source: Name
french: prénom
russian: Название

# wristbandSetSmartReminders
source: Smart reminder
french: Rappel intelligent
russian: Смарт-уведомления

# smartRemindersDescription
source: Bracelet reminder will be allowed after turning on.
french: Après l’ouverture, la notification de rappel de la sonnerie sera autorisée
russian: Разрешить присылать уведомления браслета после включения

# smartRemindersAllowNotification
source: Allow notification
french: Autoriser la notification
russian: Разрешить уведомления

# wristbandSetTakePictures
source: Take Photo
french: Prendre des photos
russian: Съемка

# wristbandSetHeartRateTest
source: HR Detection
french: Test de fréquence cardiaque
russian: Контроль ЧСС

# heartRateTestDescription
source: The device will detect the heart rate according your selection type
french: L’appareil détecte la fréquence cardiaque selon votre type de sélection
russian: Оборудование контролирует ЧСС в соответствии с выбранным вами типом

# heartRateTestAutomatic
source: Automatic
french: automatique
russian: Автоматически

# heartRateTestManual
source: Manual
french: Manuel
russian: Вручную

# wristbandSetWristIsAlwaysBright
source: Wrist Identification
french: Reconnaissance du poignet
russian: Распознавание подъема запястья

source: Wristband Set Light Screen Fail
french: Mettre le poignet à l’échec
russian: Не удалось настроить включение подсветки дисплея при повороте запястья

# wristbandSetMore
source: More
french: Plus
russian: Больше

# wristbandCancelBind
source: Unbind
french: Délier
russian: Удалить привязку

# wristbandRequestCancelBind
source: Release the wristband or not
french: Que ce soit pour soulever le bracelet actuel
russian: Удалить текущую привязку к браслету?

# wristbandSetEquipmentUpgrade
source: Device Upgrade
french: Mise à niveau de l’équipement
russian: Обновление оборудования

# wristbandSetAnti_lostReminder
source: Anti-lost Alert
french: Rappel anti-perdu
russian: Напоминание против утери

# wristbandSetLostFail
source: Lost protect system set failed
french: Réglage du mode anti-drop échoué
russian: Не удалось настроить режим утери

# wristbandSetFindPhone
source: Find Phone
french: À la recherche d’un téléphone cellulaire
russian: Поиск мобильного телефона

# wristbandSetFindPhoneFail
source: Search phone system set failed
french: Le programme d’installation pour trouver le téléphone a échoué
russian: Не удалось настроить поиск мобильного телефона

# wristbandSetHeartRateInterval
source: Heart rate zones
french: Intervalle de fréquence cardiaque
russian: Интервал ЧСС

# wristbandSetHeartRateFail
source: Heart rate system set failed
french: Le mode de fréquence cardiaque a échoué
russian: Не удалось настроить режим ЧСС

# wristbandSetRebootTheDevice
source: Restart Device
french: Redémarrez l’appareil
russian: Перезагрузить оборудование

# stepUnit
source: Step
french: étape
russian: Шаги

# consume
source: Calories
french: Consommation
russian: Расход

# calorie
source: Kcal
russian: Ккал

source: Start
french: Début
russian: Начало

source: End
french: Fin
russian: Окончание

# hour
source: H
french: Temps
russian: Часы

# minture
source: Min
french: Minute
russian: Минуты

source: Sleep
french: Dormir
russian: Сон

source: Deep Sleep
french: Sommeil profond
russian: Глубокий сон

source: Light Sleep
french: Sommeil sombre
russian: Неглубокий сон

# soberSleep
source: Awake Sleep
french: Sombre sommeil
russian: Пробуждение ото сна

# walk
source: Walking
french: Comptage des étapes
russian: Число шагов

# heartRateUnit
source: bpm
french: per/Score
russian: Раз/минута

source: Heart rate
french: Rythme cardiaque
russian: ЧСС

# averageHeartRate
source: Average HR
french: Fréquence cardiaque moyenne
russian: Средняя ЧСС

# silentHeartRate
source: Resting HR
french: Fréquence cardiaque au repos
russian: ЧСС в состоянии покоя

# maxHeartRate
source: Max HR
french: Fréquence cardiaque maximale
russian: Максимальная ЧСС

# frontCamera
source: Front camera does not support flash
french: La caméra avant ne prend pas en charge le flash
russian: Фронтальная камера не поддерживает вспышку

# totalDistances
source: Distance
french: kilométrage
russian: Расстояние

# distancesUnit
source: Km
russian: км

# totalActiveTime
source: Time
french: Temps d’activité
russian: Время активности

# add_device
source: Add
french: Ajouter à
russian: Добавить

# add_ble_device
source: Bluetooth
french: Périphérique Bluetooth
russian: Bluetooth-оборудование

# add_wifi_device
source: Wifi
russian: WiFi-оборудование

# wifi_device_connect
source: Connect Wifi
french: Connectez-vous au WiFi
russian: Подключится к WiFi

# wifi_device_pair_fail
source: Wifi repairing failed
french: Echec du réseau de distribution
russian: Не удалось настроить сеть

# wifi_device_pair_no_select_data
source: No data selected
french: Aucune donnée sélectionnée
russian: Нет выбранных данных

# wifi_name
source: Enter wifi name
french: Entrez le nom de WiFi
russian: Пожалуйста, введите имя сети WiFi

# wifi_pass_word
source: Enter wifi password
french: Entrez le mot de passe WiFi
russian: Пожалуйста, введите пароль сети WiFi

# wifi_access_net
source: Wifi under loading
french: Connexion de l’échelle WiFi au réseau
russian: Подключение весов к сети по WiFi

# wifi_current
source: Current wifi
french: Réseau actuel:
russian: Текущая сеть:

# wifi_modify_pass_word
source: Change the wifi password
french: Modifiez le mot de passe Wi-Fi
russian: Изменить пароль сети WiFi

# wifi_reset_connect
source: Try the steps below
french: Essayez ces étapes ci-dessous
russian: Попробуйте следующие шаги

# wifi_reset_connect_1
source: Re-enter the wifi password to check
french: 1. Re-saisissez le mot de passe WiFi pour vous assurer que le mot de passe est correct
russian: 1. Повторно введите пароль сети WiFi, обеспечьте правильность пароля

# wifi_reset_connect_2
source: Check the wifi signal strength to make sure its in good condition,
french: 2. Vérifiez la puissance du signal WiFi pour vous assurer que la connexion wifi est en bon état
russian: 2. Проверьте силу сигнала WiFi, обеспечьте отличное подключение к сети WiFi

# wifi_reset_connect_3
source: Restart wifi connect on the scale according to last page
french: 3. Redémarrez la fin du mode échelle, la méthode de référence spécifique à la page précédente
russian: 3. Перезапустите режим настройки сети весов, конкретный способ см. предыдущую страницу

# wifi_confirm
source: Make sure wifi allows new device
french: Assurez-vous que WiFi permet d’accéder à des périphériques inconnus
russian: Убедитесь, что подключение незнакомого оборудования к сети WiFi разрешено

# wifi_connect
source: Enter your wifi password
french: · Entrez votre mot de passe WiFi (aucun mot de passe n’est requis sans entrer de mot de passe
russian: Введите ваш пароль WiFi (ввод пароля не требуется, если пароль не настроен)

# wifi_connect_1
source: Confirm the wifi is strong enough
french: Assurez-vous que l’environnement de réseau actuel est mieux
russian: Убедитесь, что текущая сетевая среда в норме

# wifi_connect_2
source: Keep close to the scale
french: Veuillez essayer de fermer l’échelle WiFi
russian: Пожалуйста, максимально приблизьтесь к WiFi-весам

# wifi_connect_guide_open
source: Open the back of battery and then press the black button for 3 seconds
french: 1. Ouvrez le capot de la batterie, appuyez longuement sur le bouton noir pendant 3 secondes.
russian: 1. Откройте крышку аккумулятора, зажмите черную кнопку на 3 секунды.

# wifi_connect_guide_flash
source: Wifi signal on shows it works
french: 2. Le pavillon WiFi clignote pour indiquer qu’il se trouve dans le mode de distribution.
russian: 2. Индикатор WiFi мигает, что указывает на вход в режим настройки сети.

# wifi_connect_to_ble_device
source: If you can not find the black button, please try
french: Vous ne trouvez pas le bouton noir, essayez s’il vous plaît
russian: Пожалуйста, попробуйте, если вам не удалось найти черную кнопку

# wifi_device_net
source: Turn on your wifi first.
french: Tout d’abord, démarrez WiFi sur votre téléphone
russian: Прежде всего, включите WiFi в мобильном телефоне

# wifi_device_reset_net
source: Please reconnect if wifi not available
french: Le wifi actuel n’est pas disponible, reconnectez-vous
russian: Невозможно использовать WiFi, пожалуйста, переподключитесь

# wifi_device_success
source: Wifi connected successful
french: Félicitations, réussite de liaison à l’échelle WiFi s’il vous plaît
russian: Поздравляем, привязка WiFi-весов прошла успешно Пожалуйста, станьте на весы

# wifi_device_check
source: Wifi under test
french: Le test du réseau est normal
russian: Тестирование сети на предмет отклонений

# unknown_measure
source: unknow measure
french: Mesure inconnue
russian: Неизвестное измерение

# choose_data
source: Data choose
french: Sélectionner
russian: Выбрать

source: Choose all
french: tout sélectionner
russian: Выбрать все

# distribute
source: Assign
french: Distribution
russian: Передать

# unknown_measure_description
source: Unknow measurement
french: Vous avez des données de mesure inconnues
russian: Есть неизвестные данные измерений

# distribute_data_to
source: Assign the data to
french: Affecter des données à
russian: Передать данные на

# distribute_data_success
source: Data assigned
french: Répartir les données avec succès
russian: Данные успешно переданы

# delete_data_success
source: Date deleted
french: Données supprimées avec succès
russian: Данные успешно удалены

# rebootDeviceAlerts
source: Reboot the device?Data will be synced before reboot
french: Que ce soit pour redémarrer l’appareil, redémarrez les données avant la synchronisation
russian: Перезагрузить оборудование? Перед перезагрузкой произойдёт синхронизация данных

# yourHeartRateInterval
source: Your heart rate zone
french: Votre intervalle de fréquence cardiaque
russian: Ваш интервал ЧСС

# peakExercise
source: Extreme exercise
french: Exercice de pointe
russian: Пиковая тренировка

# cardiopulmonaryExercise
source: Cardio
french: Exercice cardiopulmonaire
russian: Тренировка сердца и легких

# fatExercise
source: Fat burning
french: Exercice gras
russian: Тренировка для сжигания жира

# customizeTheMaximumHeartRate
source: Custom maximum heart rate
french: Personnaliser la fréquence cardiaque maximale
russian: Максимальная ЧСС, определяемая пользователем

# theMaximumHeartRateIs
source: Maximum heart rate
french: La fréquence cardiaque maximale est
russian: Значение максимальной ЧСС

# numberOfHeartbeatsPerMinute
source: Heartbeat per minute(bpm)
french: Nombre de battements cardiaques par minute (bmp)
russian: Частота ударов сердца в минуту (bmp)

# heartRateIntervalDescription
source: Heart rate area description
french: Description de l’intervalle de fréquence cardiaque
russian: Пояснение к интервалу ЧСС

# heartRateIntervalDescription_one
source: Heart rate zone is derived based on the maximum magnification calculated per minute
french: L’intervalle de fréquence cardiaque est calculé en fonction du taux maximum par minute
russian: Интервал ЧСС рассчитывают исходя из максимальной частоты в минуту

# heartRateIntervalDescription_two
source: Peak exercise(greater than maximum heart rate of 85%)high intensity exercise interval,improve tolerance of anaerobic exercise capacity and muscle,most sugar consumption,almost no fat consumption.
french: L'exercice de pointe (supérieur à la fréquence cardiaque maximale de 85%) l'intervalle d'exercice de haute intensité, d'améliorer la capacité de l'exercice anaérobie et la tolérance musculaire, la consommation maximale de sucre, essentiellement pas de consommation de graisse.
russian: Пиковая тренировка (до 85% максимальной ЧСС) - интервал тренировок высокой интенсивности. Повышение выносливости в анаэробных упражнениях и стойкости мышц. Максимальный расход сахара, в основном, без сжигания жира.

# heartRateIntervalDescription_three
source: Cardiopulmonary exercise(maximum heart rate 70%-84% )moderate to high intensity exercise interval,the ideal cardiovascular health training,fat consumption,sugar consumption more.
french: L’exercice cardiopulmonaire (70% -84% de la fréquence cardiaque maximale) d’intervalle d’exercice de moyenne à forte intensité, la meilleure formation en santé cardiovasculaire, la consommation de graisse en général, plus de consommation de sucre.
russian: Тренировка сердца и легких (70-84% максимальной ЧСС) - интервал подходит для тренировок со средней или относительно высокой интенсивностью. Идеальная тренировка для здоровья сердца и сосудов. Обычный уровень сжигания жира, значительный расход сахара.
