Repository: ysq1051838264/MlcForExcel
Catalog: lib/src/main/java/com/hdr/mlcforexcel/forexample/mlc/TT healthier/ios/*.strings
Languages: french, russian

# heartRateIntervalDescription_four
source: Basic training exercise fat(50%-69% of maximum heart rate)of cardiovascular health,good recovery rate,body fat consumption,sugar consumption in general.
french: Exercice gras (fréquence cardiaque maximale de 50% -69%) Formation de base de la santé cardiovasculaire, bon taux de récupération, consommation de graisse corporelle, consommation de sucre en général.
russian: Тренировка для сжигания жира (50-69%) - базовая тренировка для здоровья сердца и сосудов. Отличная скорость восстановления. Максимальное сжигание жира, обычный расход сахара.

# movingTarget
source: Sports Target
french: Cible mouvante
russian: Спортивные цели

source: Sleep Target
french: Cible de sommeil
russian: Цели по сну

# wifi_device_no_measure
source: Edit information
french: modifier l’information
russian: Редактировать данные

# cancel_choose_all
source: Deselect all
french: Annuler tout sélectionné
russian: Отменить "Выбрать все"

# noConnectedWristband
source: Unconnected device
french: Dispositif non connecté
russian: Неподключенное оборудование

# auto_choose
source: Choose automatically
french: Choisir automatiquement
russian: Автоматически выбирать

# choose_compare_data
source: Select the data to compare
french: Sélectionnez les données à comparer
russian: Выберите данные для сравнения

source: share
french: partager
russian: доля

# device_manage
source: Device management
french: gestion d'appareils
russian: Управление устройствами

# idex_instruction
source: All indicators are concluded from that after measuring body bio-resistance by the device(fat scale) and combined with body composition. Values are comparable to professional medical equipment data, but are used only as controlling body size and long-term fitness monitor for reference and are not as the basis of medical data.
french: Tous les indicateurs sont conclus à partir de cela après avoir mesuré la bio-résistance du corps par l'appareil (échelle de graisse) et combiné avec la composition corporelle. Les valeurs sont comparables aux données professionnelles du matériel médical, mais ne sont utilisées que comme contrôle de la taille du corps et du moniteur de conditionnement physique à long terme pour référence et ne constituent pas la base des données médicales.
russian: Все показатели заключаются в том, что после измерения биологического сопротивления организма устройством (шкала жира) и в сочетании с составом тела. Значения сопоставимы с данными профессионального медицинского оборудования, но используются только в качестве контрольного размера тела и долгосрочного фитнес-монитора для справки и не являются основой медицинских данных.

# please_choose_valid_data
source: Please select the complete measurement data
french: Sélectionnez les données de mesure complètes
russian: Пожалуйста, выберите полные данные измерений

# please_choose_other_day_data
source: You can not select data on the same day as the current measurement data
french: Vous ne pouvez pas sélectionner des données le jour même et le temps dans les données de mesure de courant
russian: Вы не можете выбрать данные в тот же день и время в текущих данных измерений

source: save
french: enregistrer
russian: спасти

# UnablePhotoAlbum
source: Unable to access album for system reasons
french: Impossible d'accéder à l'album pour des raisons système
russian: Невозможно получить доступ к альбому по системным причинам

# saveSuccess
source: Save successfully
french: enregistrée avec succès
russian: Успешно сохранено

# saveFail
source: Save failed
french: Échec de la sauvegarde
russian: Ошибка сохранения

# system_help_center
source: User's Guide
french: Guide de l'utilisateur
russian: Руководство пользователя

# bodyfatChange
source: Measure your body fat rate varies greatly
french: Mesurer votre taux de graisse corporelle varie grandement
russian: Измерение уровня жира в организме сильно варьирует

source: Time
french: temps
russian: время

# increaseWeight
source: Weight gain
french: Gain de poids
russian: Увеличение веса

source: Reduce weight
french: Réduire la perte
russian: Уменьшить потери

source: Increase BodyFat
french: Augmenter BodyFat
russian: Увеличить BodyFat

source: Reduce BodyFat
french: Réduire le BodyFat
russian: Уменьшить BodyFat

source: day
french: journée
russian: день

# check
source: Look
french: Regardez
russian: смотреть

# rightMeasureWay
source: Correct measurement method
french: Méthode de mesure correcte
russian: Правильный метод измерения

# IOS_cancelBindWristband
source: After deciding whether to unbind the device n unzip it, go to [Settings] -> [Bluetooth] to ignore the device, otherwise it will no longer be able to bind the device
french: Si vous êtes sûr de déverrouiller le périphérique décompressez-le, accédez à [Configuration] -> [Bluetooth] pour ignorer l’appareil, sinon le périphérique ne peut être lié
russian: Вы точно хотите отвязать оборудование? Отвязав оборудование, пожалуйста, в [Настройки] > [Bluetooth] выберите "Игнорировать" данное оборудование. В противном случае, в последующем данное оборудование будет невозможно привязать повторно

# latest_date
source: Is the latest date
french: La dernière date
russian: Последняя дата

# unbind_wrist_tip
source: You have not bound the bracelet, now to bind
french: Vous n’avez pas lié le bracelet, maintenant pour lier
russian: Вы не привязали браслет, привяжите сейчас

# one_bind_wrist
source: Can only bind one bracelet
french: Ne peut lier un bracelet
russian: Можно привязать только один браслет

# action
source: sport
french: activité
russian: Активность

# step_num
source: Total number of steps
french: Nombre total d’étapes
russian: Общее число шагов

source: today
french: Aujourd’hui
russian: Сегодня

source: every day
french: tous les jours
russian: Каждый день

source: Alarm clock
french: Réveil
russian: Будильник

# noBindDevice
source: You have not yet bound the device
french: Vous n’avez pas encore lié l’appareil
russian: Вы не привязали оборудование

source: Dropdown Refresh
french: Tire vers le bas pour vous rafraîchir
russian: Потяните для обновления

source: Refreshing
french: Est rafraîchissante
russian: Обновление…

source: Release Refresh
french: Desserrez le rafraîchissement
russian: Отпустите для обновления

source: return today
french: Retour aujourd’hui
russian: Вернуться к сегодняшнему дню

source: unknown
french: inconnu
russian: Неизвестно

# restart
source: Reboot
french: Redémarrer
russian: Перезагрузить

# fresh_success
source: Synchronization data is successful
french: La synchronisation est réussie
russian: Синхронизация прошла успешно

# fresh_failed
source: Synchronization data failed
french: La synchronisation a échoué
russian: Не удалось синхронизировать

# fresh_free
source: Are being synchronized
french: Être synchronisé
russian: Синхронизация…

# freshing
source: Are being synchronized%s
french: Synchronisation% s
russian: Синхронизировано%s

# no_code_click
source: Don't get verification code, click
french: Ne peut pas recevoir le code de vérification, cliquez
russian: Если код подтверждения не пришел, кликните

# mean_here
source: here
french: Ici
russian: Здесь

# retrieve_account_name
source: Username
french: Nom d’utilisateur
russian: Имя пользователя

# lastWeight_value
source: The last time measuring weight
french: La dernière mesure du poids corporel
russian: Вес при последнем измерении

# extent_of_amendment
source: (range + / - 0.5)
french: (Plage ± 0,5)
russian: (диапазон ±0.5)

source: New password
french: nouveau mot de passe
russian: Новый пароль

# retrieve_account_title
source: Get back account
french: Récupérer le numéro de compte
russian: Восстановить учетную запись

# weightunit_effect
source: Switch unit to be connected to the scale after the effective
french: L’unité de commutation doit être connectée à l’échelle avant qu’elle ne puisse prendre effet
russian: Переключение единиц вступит в силу только после подключения к весам

# weightunit_onbrightScale
source: Please step on the scale
french: Augmenter l’échelle
russian: Пожалуйста, станьте на весы

# weightunit_detection
source: To measure
french: Mesurer
russian: Измерить

# fitbit_checkQuestion
source: Please check if having question
french: Avez-vous des questions s’il vous plaît consulter
russian: Пожалуйста, просмотрите в случае сомнений

# feedBack_cannotReceiveEmailCode
source: Do not receive email verification code
french: Aucun code de vérification par courrier électronique reçu
russian: Код подтверждения не пришел на e-mail

# feedBack_BLE
source: Bluetooth problem
french: Problème Bluetooth
russian: Проблемы Bluetooth

# feedBack_use
source: Usage problem
french: Utilisez le problème
russian: Проблемы использования

# feedBack_advice
source: Suggestions
french: Suggérer
russian: Рекомендации

# feedBack_other
source: Others
french: autre
russian: Другое

# getBack_skipNext
source: If there is no measurement data, click the next step directly
french: S’il n’y a pas de données de mesure, cliquez sur Suivant
russian: Если данные измерений отсутствуют, просто кликните "Далее"

# measure_date
source: Measuring time
french: mesure le temps
russian: Время измерения

# measure_data
source: Measurement data
french: Données de mesure
russian: Данные

# file_generate_fail
source: Failed to generated CSV file, please try again
french: Le fichier CSV généré a échoué, essayez à nouveau
russian: Не удалось создать файл CSV, пожалуйста, попробуйте снова

# get_write_permission_fail
source: Failed to get file reading and writing permissions, please reset
french: Obtenir l’autorisation de lecture et d’écriture de fichier échouée, réinitialiser
russian: Не удалось получить доступ к правам считывания и записи файла, пожалуйста, настройте повторно

# close_device
source: Turn off
french: fermer
russian: Закрыть

# wifi_not_open
source: Your iPhone has not yet turned on WiFi. Please turn on WiFi first.
french: Votre iPhone n’a pas encore ouvert WiFi Tout d’abord, démarrez WiFi
russian: WiFi в вашем iPhone не включен Сначала включите WiFi

# wifi_open
source: Turn on WiFi
french: Démarrez WiFi
russian: Включить WiFi

# wifi_available
source: The current WiFi network is open and enters the configuration process
french: Le réseau WiFi actuel est ouvert et entre dans le processus de configuration
russian: В настоящее время сеть WiFi работает безотказно, перейдите к процедуре настройки

# wifi_not_available
source: The current WiFi network is not expedite, please have a check.
french: Le réseau WiFi actuel n’est pas ouvert, vérifiez le statut WiFi
russian: В настоящее время сеть WiFi работает с перебоями, пожалуйста, проверьте состояние WiFi

# wifi_up_open
source: Swipe up to turn on control ...
french: Glisser vers le haut pour ouvrir le contrôle ...
russian: Потяните вверх, чтобы открыть управление…

# wifi_config
source: Allocate WiFi for the scale
french: Configurer WiFi pour l’échelle
russian: Настройка сети WiFi для весов

# wifi_change
source: Switch WiFi
russian: Сменить сеть WiFi

# wifi_config_notice1
source: · Do no support 5G band WiFi currently
french: · Actuellement pas de support pour 5G band WiFi
russian: · В настоящее время диапазон частот WiFi 5G не поддерживается

# wifi_config_notice2
source: · Make sure the current network environment is good
french: · Assurez-vous que l’environnement réseau actuel est bon
russian: · Пожалуйста, убедитесь, что в настоящее время сетевая среда в отличном состоянии

# wifi_config_notice3
source: • Password is not needed if WiFi password not be set.
french: · Aucun mot de passe requis sans connexion WiFi
russian: · Пароль WiFi не требуется, если пароль не настроен

# wifi_config_notice4
source: · Make sure WiFi allows unfamiliar devices to access
french: · Assurez-vous que WiFi permet d’accéder à des périphériques inconnus
russian: · Убедитесь, что подключение незнакомого оборудования к сети WiFi разрешено

# wifi_config_start
source: Start to configure network
french: Démarrer le réseau de distribution
russian: Начать настройку сети

# wifi_config_again
source: Re-configure network
french: Réseau de redistribution
russian: Перенастроить сеть

# wifi_identifying
source: You are identifying the WiFi scale model
french: Vous identifiez le modèle à échelle WiFi
russian: Распознавание модели WiFi-весов

# wifi_identify_failed
source: Recognition failed
french: La reconnaissance a échoué
russian: Не удалось распознать

# wifi_identify_again
source: Re-identification
french: Ré-identification
russian: Распознать повторно

# wifi_binding
source: We are binding WiFi scale
french: Nous appliquons l’échelle WiFi
russian: Привязка WiFi-весов

# wifi_bind_succeed
source: Binding successful
french: Relance réussie
russian: Привязка прошла успешно

# wifi_bind_failed
source: WiFi scale binding failed
french: La liaison à l’échelle WiFi a échoué
russian: Не удалось привязать WiFi-весы

# wifi_bind_again
source: Rebinding
french: Rembobinage
russian: Привязать повторно

# wifi_connect_notice1
source: Do not be far away from body scales
french: · Ne vous éloignez pas des écailles corporelles
russian: ·Не удаляйте мобильный телефон от весов с анализатором процента жира

# wifi_connect_notice2
source: · Make sure the network is in good condition during connection
french: · Assurez-vous que le réseau est en bon état pendant la connexion
russian: ·Обеспечьте отличную сетевую среду в процессе подключения

# wifi_connect_notice3
source: · Do not close the screen during connection
french: · Ne fermez pas l’écran pendant la connexion
russian: ·Пожалуйста, не выключайте дисплей в процессе подключения

# wifi_connect_find
source: Immediate investigation
french: Enquête immédiate
russian: Проверить немедленно

# wifi_connect_click
source: · Still not connected, please click
french: · Toujours non connecté, cliquez sur
russian: ·Пожалуйста, кликните, если по-прежнему не удается подключится

# wifi_config_question
source: Problem investigation
french: Dépannage
russian: Проверка на предмет проблем

# wifi_connect_final
source: The last step
french: La dernière étape
russian: Остался последний шаг

# wifi_connect_complete
source: Complete
french: effectuer
russian: Готово

# measure_select_data
source: Please select the data you want to assign or delete
french: Sélectionnez les données que vous souhaitez affecter ou supprimer
russian: Пожалуйста, выберите данные, которые необходимо передать или удалить

# measure_delete_data
source: Are you sure to delete the selected data?
french: Êtes-vous sûr de vouloir supprimer les données sélectionnées?
russian: Вы точно хотите удалить все выбранные данные?

# awaitReadMessage
source: If you have an unread message, please click here to view it
french: Si vous avez un message non lu, cliquez ici pour le voir
russian: Если у вас есть непрочитанное сообщение, нажмите здесь, чтобы просмотреть его.

# addMembers
source: Add a member
french: Ajouter des membres
russian: Добавить участников

# heartRateLowerDescription
source: Heart rate over less than 40 times, mostly seen in heart disease patients often have palpitations, chest tightness, chest discomfort, early detection, symptomatic treatment. There are exceptions: a heart rate less than 40 times in some very healthy person, who has long been engaged in heavy physical labor and intense exercise, their heart has been tempered, much less than average number of heartbeats.
french: La fréquence cardiaque de plus de 40 fois, principalement observée chez les patients souffrant de maladie cardiaque, souvent des palpitations, une étouffeté thoracique, une gêne précordiale, devrait être une vérification précoce, un traitement symptomatique. Il existe des exceptions: Fréquence cardiaque de moins de 40 fois, il y a des personnes très en bonne santé, longtemps engagées dans un travail physique important et un exercice intense de personnes, leurs cœurs ont été exercés, le nombre de battements cardiaques est beaucoup moins élevé que les gens ordinaires.
russian: ЧСС ниже 40 раз часто встречается у пациентов с заболеваниями сердца. Часто присутствует сердцебиение, ощущение стеснения в груди, заболевания предкардиальной области. Следует провести осмотр как можно раньше и назначить симптоматическое лечение. Также есть исключения: ЧСС ниже 40 раз бывает у некоторых здоровых людей. Люди, которые длительное время занимаются тяжелым физическим трудом или активно тренируются. Их сердце также тренировано и частота пульса намного ниже, чем у обычных людей.

# heartRateLowDescription
source: Sinus bradycardia. Can be seen in the long-term engaged in physical labor and athletes; pathology seen in the hypothyroidism, increased intracranial pressure, obstructive jaundice, and digitalis, quinidine, or propranolol drug overdose or poisoning
french: Bradycardie sinusale. Peut être vu à long terme engagé dans le travail physique et les athlètes; Les résultats pathologiques dans l’hypothyroïdie, l’augmentation de la pression intracrânienne, l’ictère obstructif, ainsi que la surdose ou l’intoxication par le médicament digitalis, la quinidine ou le propranolol
russian: Синусовая брадикардия. Часто наблюдается у людей, занимающихся физическим трудом и спортсменов. В случае патологии наблюдается при снижении функции щитовидной железы, повышении внутричерепного давления, застойной желтухе, а также превышении дозы или отравлении наперстянкой пурпурной, хинидином, Пропранололом

# heartRateStandDescription
source: Healthy adult heart rate is 60 to 100 beats / min, the majority of 60 to 80 beats / min, women slightly faster
french: Fréquence cardiaque adulte saine de 60 à 100 fois/min, la plupart des 60 à 80 fois/min, les femmes un peu plus vite
russian: ЧСС здорового взрослого человека 60～100 раз/минута, у большинства 60～80 раз/минута, у женщин несколько быстрее

# heartRateHighDescription
source: Sinus tachycardia. Common in normal movement, excitement, emotion, smoking, drinking and after drinking tea; also be found in fever, shock, anemia, hyperthyroidism, heart failure and atropine, epinephrine, ephedrine.
french: Tachycardie sinusale. Fréquent dans les sports normaux, l’excitation, l’excitation, le tabagisme, l’alcool et le thé; Aussi vu en fièvre, choc, anémie, hyperthyroïdie, insuffisance cardiaque et l’application d’atropine, d’épinéphrine, d’éphédrine, etc.
russian: Синусовая тахикардия. Часто наблюдается у здоровых людей после спорта, волнения, возбуждения, курения, употребления алкоголя и чая. Также встречается при повышении температуры, шоке, малокровии, гипертиреозе, сердечной недостаточности и применении атропина, адреналина, эфедрина и др.

# heartRateHigherDescription
source: Heart rate more than 160 times, mostly seen in heart disease patients often have palpitations, chest tightness, chest discomfort, early detection, symptomatic treatment.
french: La fréquence cardiaque de plus de 160 fois, principalement observée chez les patients souffrant de maladie cardiaque, souvent palpitations, oppression thoracique, gêne précordiale, devrait être un traitement précoce, un traitement symptomatique.
russian: Превышение ЧСС 160 раз часто встречается у пациентов с заболеваниями сердца. Часто присутствует сердцебиение, ощущение стеснения в груди, заболевания предкардиальной области. Следует провести осмотр как можно раньше и назначить симптоматическое лечение.

# calcHeartIndexLowDescription
source: Many below the normal range will cause a serious shortage of blood supply to the brain, memory loss and so on. Specific judgment can not only rely on this one index, and need to combine the judgment between ECG and chest X-ray.
french: Au-dessous de la gamme normale de beaucoup peuvent causer une insuffisance cérébrale grave, une perte de mémoire et ainsi de suite. Les jugements spécifiques peuvent non seulement s’appuyer sur ce seul indicateur, il faut combiner ECG et le jugement radiographique de la poitrine.
russian: Уровень ниже нормального часто провоцирует недостаточное кровоснабжение мозга, ухудшение памяти и др. Конкретные выводы нельзя сделать, опираясь только на этот показатель. Для выводов их необходимо дополнить ЭКГ и рентгеном грудной клетки.

# calcHeartIndexStandDescription
source: Evaluation of cardiac pumping function with standard L/min/m^2
french: Evaluation de la fonction de pompe cardiaque pour évaluer le statut de la fonction cardiaque. L’unité est: L/min/m^2
russian: Оценка функции перекачивания крови сердцем является оценкой состояния сердечной функции. Единицы: л/мин/м2 (литр/минута/метр квадратный)

# calcHeartIndexHighDescription
source: Higher than the normal value indicates that the blood pump is too strong, and easy to cause palpitation. Specific judgment can not only rely on this one index, and need to combine the judgment between ECG and chest X-ray.
french: Plus élevée que la valeur normale indique que la pompe est trop forte, facile à provoquer des palpitations. Les jugements spécifiques ne peuvent pas seulement s’appuyer sur ce seul indicateur, doivent combiner ECG et le jugement radiographique de la poitrine
russian: Превышение нормальных показателей указывает на чрезмерно активное перекачивание крови, может с лёгкостью возникнуть учащенное сердцебиение. Конкретные выводы нельзя сделать, опираясь только на этот показатель. Для выводов их необходимо дополнить ЭКГ и рентгеном грудной клетки.

source: Too low
french: Trop bas
russian: Слишком низкая

source: Too high
french: Trop haut
russian: Слишком высокая

# normality
source: Normal
russian: Нормальная

# calcHeartIndex
source: Heart index
french: Indice cardiaque
russian: Сердечный индекс

# alertErrorMessage
source: Account information input error, please try again
french: Erreur de saisie des informations du compte, corrigez et réessayez
russian: Ошибка при вводе данных аккаунта, пожалуйста, исправьте и попробуйте снова

# feedBack_email_address_prompt
source: Please enter your email
french: Entrez votre adresse e-mail d’abord
russian: Пожалуйста, введите ваш e-mail

# chose_current_data
source: Select the current data
french: Sélectionnez les données du mois
russian: Выбрать данные за текущий месяц

# chose_all_data
source: Select all data
french: Sélectionnez toutes les données
russian: Выбрать все данные

# please_open_chose_mode
source: Please turn on filtering mode for data first
french: Activez d’abord le mode de données de filtre
russian: Пожалуйста, сначала включите режим фильтрации данных

# login_rememberPwd
source: Remember the password
french: Se souvenir du mot de passe
russian: Запомнить пароль

# share_no_data_prompt
source: Please select the data you want to export first
french: Veuillez sélectionner les données que vous voulez exporter en premier
russian: Сначала выберите данные, которые хотите экспортировать.

# detection_compare
source: Compare To
french: Comparer aux
russian: По сравнению с

# detection_nodata_contentText
source: Weight is not the only, n immediately on the scale get the ultimate truth about the body!
french: Le poids n'est pas le seul, n immédiatement sur l'échelle obtenir la vérité ultime sur le corps!
russian: Вес не единственный, n сразу на шкале получить предельную правду о теле!

# detection_nodata_description
source: · Remember the barefoot measurement, socks have to take off it ~ n early morning fasting is the ideal measurement time Oh!
french: · Rappelez-vous la mesure pieds nus, les chaussettes doivent décoller ~ n tôt le matin le jeûne est le temps de mesure idéal Oh!
russian: · Помните босиком измерения, носки должны снять его ~ n раннего утра пост является идеальным временем измерения Oh!

# fitbit_fail
source: Fitbit authorization failed
french: Échec de l'autorisation Fitbit
russian: Ошибка авторизации Fitbit

# fitbit_pass_due
source: Fitbit authorization expired
french: L'autorisation Fitbit a expiré
russian: Истек срок действия лицензии на Fitbit
